Tekla.Structures.ModelInternal.RebarLegFace
Defines an abstract leg face within a rebar set.

Tekla.Structures.ModelInternal.RebarLegFace.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarLegFace class.

Tekla.Structures.ModelInternal.RebarLegFace.#ctor(Tekla.Structures.Model.Contour)
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarLegFace class.
contour: The primary contour.

Tekla.Structures.ModelInternal.RebarLegFace.CloneRebarLegFace
Clone RebarLegFace.
Returns: The Tekla.Structures.ModelInternal.RebarLegFace.

Tekla.Structures.ModelInternal.RebarLegFace.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarLegFace.SelectInstance(System.Int32)
The select instance.
id:
The id.
Returns:
The System.Boolean.

Tekla.Structures.ModelInternal.RebarLegFace.ToStruct(Tekla.Structures.ModelInternal.dotLegFace_t@)
The to struct.
dotLegFace:
The dot leg face.

Tekla.Structures.ModelInternal.RebarLegFace.FromStruct(Tekla.Structures.ModelInternal.dotLegFace_t@)
The from struct.
dotLegFace:
The dot leg face.

Tekla.Structures.ModelInternal.RebarLegFace.Id
Gets an identifier that may be used to identify instances of the same face.

Tekla.Structures.ModelInternal.RebarLegFace.AdditonalOffset
Gets or sets the user defined offset of the rebars from this face.

Tekla.Structures.ModelInternal.RebarLegFace.LayerOrderNumber
Gets or sets the layer order number.

Tekla.Structures.ModelInternal.RebarLegFace.Reversed
Gets or sets a value indicating whether the cover thickness is opposite to the coordinate system Z direction.

Tekla.Structures.ModelInternal.RebarLegFace.PrimaryContour
Gets or sets the primary outer contour of the leg face.

Tekla.Structures.ModelInternal.RebarLegFace.SurfaceType
Gets or sets the surface type of the face.